/*寻找[m,n]区间内的所有勾股弦数并输出，其中，100<m<10000，
100<n<10000，m<n。勾股弦数指一个数前两位数字的平方和等于后一位或两位数字
组成的数的平方，并且这3个数都不能为0。例如101和1001不是勾股弦数，
345是勾股弦数3*3+4*4=5*5，6810是勾股弦数6*6+8*8=10*10。

①   写函数int f(int n)，判断n是否为勾股弦数，若是返回1，不是返回0。

②   编写main函数，接收键盘输入的m和n的值，判断是否符合m和n的条件，
不符合继续输入，符合则使用循环遍历区间内的每个数，调用函数f判断每个数
是否为勾股弦数，若是则输出。*/
#include <stdio.h>

void f(int n);

int main(void)
{
    int m, n;

    do
    {
        scanf("%d%d", &m, &n);
    } while (m < 100 || m > 10000 || n < 100 || n > 10000);

    for (; m <= n; m++)
        f(m);
    return 0;
}

void f(int n)
{
    int a, b, c, m = 0, ori = n;

    while (n != 0)
    {
        m *= 10;
        m += n % 10;
        n /= 10;
    }
    a = m % 10;
    b = m / 10 % 10;
    c = ori > 1000 ? ori - a * 1000 - b * 100 : ori - a * 100 - b * 10;
    if (a != 0 && b != 0 && c != 0)
        if (a * a + b * b == c * c)
            printf("%d:%d*%d+%d*%d=%d*%d\n", ori, a, a, b, b, c, c);
}