/*找出所有满足以下特性的6位整数：它是一个完全平方数
（完全平方数是指该数是某个整数的平方），该数同时也是回文数
（回文数是指该数等于它的反序数）。*/

#include <stdio.h>

int main(void)
{
    int i, n, j, k, m;
    int a[6];

    for (i = 316; i < 1000; i++)
    {
        n = i * i;
        for (j = 0; j < 6; j++)
        {
            k = n % 10;
            a[j] = k;
            n /= 10;
        }
        n = i * i;
        m = a[0] * 100000 + a[1] * 10000 + a[2] * 1000 + a[3] * 100 + a[4] * 10 + a[5];
        if (n == m)
            printf("%d", n);
    }
    return 0;
}